import { Component, OnInit } from '@angular/core';
import { VaccineServiceService } from 'src/app/service/vaccine-service.service';
import { ActivatedRoute, Router, ParamMap } from '@angular/router';
import { first, map } from 'rxjs/operators';
import { HttpClient } from '@angular/common/http';
import { LoadingService } from 'src/app/service/loading.service';

@Component({
  selector: 'app-vacine1-detail',
  templateUrl: './vacine1-detail.page.html',
  styleUrls: ['./vacine1-detail.page.scss'],
})
export class Vacine1DetailPage implements OnInit {

  constructor(private vacService: VaccineServiceService,
    private activatedRoute: ActivatedRoute,
    private router: Router,
    private http: HttpClient,
    private loadingService: LoadingService) { }


  Code: any;
  VacDetail: any;
  VacHeadTH: string;
  VacHeadEN: string;
  VacTotal: string;
  VacAge: string;

  Descript: string;
  Effect: string;
  After: string;
  Cost1: string;
  Cost2: string;




  ngOnInit() {
    this.loadingService.show("Loading");
    this.activatedRoute.paramMap
      .subscribe((queryParams: ParamMap) => {
        this.Code = queryParams.get('code');
        this.FormLoadByCode(this.Code)
      });
    this.loadingService.hide();
  }

  FormLoadByCode(code: string) {

    return this.vacService.getVacByCode(code).pipe(first())
      .subscribe(
        data => {
          console.log(data.data, "DDDDD")
          this.VacDetail = data.data[0];
          console.log(this.VacDetail, "Detail")

          this.VacHeadTH = this.VacDetail.vacnameth;
          this.VacHeadEN = this.VacDetail.vacnameen;
          this.VacTotal = this.VacDetail.vactotal;
          this.VacAge = this.VacDetail.vacage;

          if (this.VacDetail.vaccode == "A001") {
            this.Descript = "วัณโรคเกิดจากเชื้อแบคทีเรีย สามารถติดเชื้อได้ผ่านการไอ จามหรือการพูดคุย โดยจะมีอาการไอเรื้อรัง มีเสมหะ มีไข้ต่ำๆ อ่อนเพลีย เบื่ออาหาร น้ำหนักลด และแน่นหน้าอก และอาจรุนแรงจนถึงขั้นเสียชีวิต"
            this.Effect = "อาจเป็นแผลหนองและต่อมน้ำเหลืองบริเวณที่ฉีด";
            this.After = "ควรดูเเลรักษาความสะอาดบริเวณผิวหนังที่ฉีด โดยใช้สําลีสะอาดชุบน้ำเช็ดให้สะอาด ถ้าต่อมน้ำเหลืองโตและเป็นฝี ควรพบแพทย์เพื่อทำการดูดหนองออก และรับยาต้านวัณโรคในบางกรณี";
            this.Cost1 = "ราคาเข็มละ 600-1200 บาท";
            this.Cost2 = "ฟรี"
          }
          else if (this.VacDetail.vaccode == "A002") {
            this.Descript = "ไวรัสตับอักเสบบีเกิดจากเชื้อไวรัสที่อยู่ภายในเลือด สามารถติดเชื้อผ่านทางเลือด โดยจะมีอาการอ่อนเพลีย เบื่ออาหาร มีไข้ต่ำ ปวดท้อง ตัวเหลือง ตาเหลือง และอาจเป็นโรคตับแข็งและมะเร็งตับได้";
            this.Effect = "อาจมีอาการปวด บวม บริเวณที่ฉีด หรือมีไข้ต่ำประมาณ 1-2วัน";
            this.After = "ควรให้ทานยาลดไข้ และเช็ดตัวด้วยน้ำอุณหภูมิห้อง ส่วนบริเวณที่บวมให้ใช้ธีประคบเย็น";
            this.Cost1 = "ราคาเข็มละ 600-1200 บาท";
            this.Cost2 = "ราคาเข็มละ 300-500 บาท";
          }
          else if (this.VacDetail.vaccode == "A003") {
            this.Descript = "โรคคอตีบ เกิดจากเชื้อแบคทีเรียที่อยู่ภายในเยื่อบุคอ สามารถติดเชื้อผ่านทางน้ำลาย เสมหะ น้ำมูก การหายใจ ไอ หรือ จาม โดยจะมีอาการคออักเสบอย่างรุนแรง อาจทำให้เสียชีวิตจากทางเดินหายใจอุดกั้นได้ หรือจากพิษของเชื้อทำให้กล้ามเนื้อหัวใจอักเสบ หรือปลายประสาทอักเสบได้ โรคไอกรน เกิดจากเชื้อเเบคทีเรียที่อยู่ในลำคอ สามารถติดเชื้อผ่านทางละอองที่เกิดจากการไอ หรือจาม โดยจะมีอาการไอรุนแรง หายใจเข้ามีเสียงดัง หรือการอาเจียนจากการไอ ตัวเขียว จนหยุดหายใจได้ โรคบาดทะยัก เกิดจากเชื้อเเบคทีเรียที่อยู่ในดิน ฝุ่นละออง ผิวหนัง และอุจจาระของคน สามารถติดเชื้อผ่านทางบาดแผลโดยเฉพาะบาดแผลที่ลึกเข้าไปในผิวหนัง โดยจะมีอาการกล้ามเนื้อทำงานผิดปกติ ขากรรไกรแข็ง อ้าปากไม่ค่อยได้ เกร็ง ชักกระตุก หรือหยุดหายใจได้ โรคคอตีบ เกิดจากเชื้อแบคทีเรียที่อยู่ภายในเยื่อบุคอ สามารถติดเชื้อผ่านทางน้ำลาย เสมหะ น้ำมูก การหายใจ ไอ หรือ จาม โดยจะมีอาการคออักเสบอย่างรุนแรง อาจทำให้เสียชีวิตจากทางเดินหายใจอุดกั้นได้ หรือจากพิษของเชื้อทำให้กล้ามเนื้อหัวใจอักเสบ หรือปลายประสาทอักเสบได้ โรคไอกรน เกิดจากเชื้อเเบคทีเรียที่อยู่ในลำคอ สามารถติดเชื้อผ่านทางละอองที่เกิดจากการไอ หรือจาม โดยจะมีอาการไอรุนแรง หายใจเข้ามีเสียงดัง หรือการอาเจียนจากการไอ ตัวเขียว จนหยุดหายใจได้ โรคบาดทะยัก เกิดจากเชื้อเเบคทีเรียที่อยู่ในดิน ฝุ่นละออง ผิวหนัง และอุจจาระของคน สามารถติดเชื้อผ่านทางบาดแผลโดยเฉพาะบาดแผลที่ลึกเข้าไปในผิวหนัง โดยจะมีอาการกล้ามเนื้อทำงานผิดปกติ ขากรรไกรแข็ง อ้าปากไม่ค่อยได้ เกร็ง ชักกระตุก หรือหยุดหายใจได้";
            this.Effect = "อาจมีไข้ ปวด บวม แดงบริเวณที่ฉีด";
            this.After = "ควรให้ทานยาลดไข้ และเช็ดตัวด้วยน้ำอุณหภูมิห้อง ส่วนบริเวณที่บวมให้ใช้ธีประคบเย็น";
            this.Cost1 = "ราคาเข็มละ 1,000-1,500 บาท";
            this.Cost2 = "ราคาเข็มละ 350-700 บาท";
          }
          else if (this.VacDetail.vaccode == "A004") {
            this.Descript = "เชื้อฮิบเกิดจากเชื้อแบคทีเรียที่อยู่ในโพรงจมูกเเละลำคอ สามารถติดเชื้อผ่านการหายใจ หรือจากการสัมผัสโดยตรง โดยจะมีอาการไข้ ปวดศีรษะ ชัก คอเเข็ง และอาจทำให้เป็นโรคเยื่อหุ้มสมองอักเสบ ปอดบวม โรคข้ออักเสบ โรคติดเชื้อในกระแสเลือด และอาจเสียชีวิตได้";
            this.Effect = "อาจมีไข้  และอาการปวดบวมบริเวณที่ฉีด";
            this.After = "ควรให้ยาลดไข้เเละเช็ดตัวด้วยน้ำอุณหภูมิห้อง ส่วนบริเวณที่บวมให้ใช้วิธีประคบเย็น";
            this.Cost1 = "ราคา 2,500-5,000 บาท";
            this.Cost2 = "ราคา1,000-2,000 บาท";
          }
          else if (this.VacDetail.vaccode == "A005") {
            this.Descript = "โรคติดเชื้อโรต้า เกิดจากเชื้อไวรัส สามารถติดต่อจากการทานอาหารเเละน้ำดื่มที่มีเชื้อปนเปื้อน หรือสัมผัสสิ่งของที่มีเชื้อ โดยจะมีอาการปวดท้อง ท้องเสีย มีไข้อาเจียน เกิดภาวะขาดน้ำและเกลือแร่";
            this.Effect = "อาจมีอาการไข้ เบื่ออาหาร อาเจียน งอแง";
            this.After = "ควรให้ยาลดไข้เเละเช็ดตัวด้วยน้ำอุณหภูมิห้อง ส่วนบริเวณที่บวมให้ใช้วิธีประคบเย็น";
            this.Cost1 = "ราคาเข็มละ 900-1,500 บาท";
            this.Cost2 = "ราคาเข็มละ 500-600 บาท";
          }
          else if (this.VacDetail.vaccode == "A006") {
            this.Descript = "โรคหัด : เกิดจากเชื้อไวรัสที่อยู่ในระบบทางเดินหายใจ สามารถติดต่อจากการไอ จาม เเละการหายใจร่วมกับผู้ป่วย โดยจะมีอาการไข้ ผื่น ตาแดง เเละอาจเกิดโรคแทรกซ้อนได้ เช่น หูอักเสบ ปอดอักเสบ ท้องเดิน สมองอักเสบ และอาจเสียชีวิตจากโรคแทรกซ้อนทางสมองและปอดได้   โรคคางทูม : เกิดจากเชื้อไวรัส ทำให้เกิดอาการอักเสบของต่อมน้ำลายส่วนมากเกิดที่ต่อมน้ำลายบริเวณกกหู หรืออาจเกิดโรคเยื่อหุ้มสมองอักเสบได้ แต่มักไม่รุนแรงถึงขั้นเสียชีวิต   โรคหัดเยอรมัน : เกิดจากเชื้อไวรัส สามารถติดต่อได้ง่ายจากการสัมผัสเเละการหายใจร่วมกับผู้ป่วย ผู้ที่ติดเชื้อจะมีอาการปวดศีรษะ ปวดเมื่อย ไข้ต่ำๆ ตุ่มน้ำ";
            this.Effect = "อาจมีไข้เเละผื่นขึ้นคล้ายโรคหัด";
            this.After = "ควรให้ทานยาลดไข้เเละเช็ดตัวด้วยน้ำอุณหภูมิห้อง";
            this.Cost1 = "ราคาเข็มละ 700-1200 บาท";
            this.Cost2 = "ราคาเข็มละ 300-700 บาท";
          }
          else if (this.VacDetail.vaccode == "A007") {
            this.Descript = "โรคไข้สมองอักเสบเจอี เกิดจากเชื้อไวรัสสามารถติดต่อจากการถูกยุงรำคาญกัด โดยจะมีอาการไข้สูง ปวดศีรษะ คอแข็ง กระตุก สั่น มีอาการชัก เป็นอัมพาต หรือมีอาการเพ้อ จนกระทั่งหมดสติและโรคนี้มีความรุนแรงถึงขั้นเสียชีวิตได้";
            this.Effect = "อาจมีอาการปวด บวม แดงบริเวณที่ฉีด มีไข้ อ่อนเพลีย ปวดศีรษะ ปวดเมื่อย คลื่นไส้ เกิดผื่นแพ้แบบลมพิษ";
            this.After = "ควรให้ยาลดไข้เเละเช็ดตัวด้วยน้ำอุณหภูมิห้อง ส่วนบริเวณที่บวมให้ใช้วิธีประคบเย็น";
            this.Cost1 = "1,000-2,000 บาท";
            this.Cost2 = "300-500 บาท";
          }
          else if (this.VacDetail.vaccode == "A008") {
            this.Descript = "โรคไข้หวัดใหญ่เกิดจากเชื้อไวรัส ติดต่อได้ผ่านการหายใจร่วมกัน หรือ การไอ จามโดยมีจะอาการไข้ คัดจมูกและน้ำมูกไหล ไข้หวัดใหญ่จะหายเองได้ภายใน 5-7 วัน แต่หากไม่มีภูมิคุ้มกันอาจเกิดอาการป่วยรุนแรงและมีโรคแทรกซ้อนได้";
            this.Effect = "อาจมีไข้ต่ำ อาการคัดจมูก น้ำมูกไหล";
            this.After = "ควรให้ทานยาลดไข้เเละเช็ดตัวด้วยน้ำอุณหภุมิห้อง";
            this.Cost1 = "ราคาเข็มละ 600-1,500 บาท";
            this.Cost2 = "ราคาเข็มละ 500-600 บาท";
          }
          else if (this.VacDetail.vaccode == "A009") {
            this.Descript = "โรคโปลิโอเกิดจากเชื้อไวรัสที่มีทั้งหมด 3 สายพันธุ์ ซึ่งพบอยู่ในบริเวณลำไส้และถูกขับถ่ายออกมากับอุจจาระ มักเกิดโรคในเด็กเล็กที่อายุต่ำกว่า 5 ปี เพราะยังไม่มีภูมิต้านทานโรค สามารถติดต่อผ่านทางอาหารหรือน้ำที่ปนเปื้อนเชื้อ ทำให้เกิดอาการอัมพาตที่ขาแบบเฉียบพลัน ปวดกล้ามเนื้อ กล้ามเนื้อลีบ และอาจเกิดอาการอัมพาตของระบบหายใจ จนเสียชีวิตได้";
            this.Effect = null;
            this.After = null;
            this.Cost1 = "เข็มละ 600-1,500บาท";
            this.Cost2 = "เข็มละ 300-500 บาท";
          }
          
          else if (this.VacDetail.vaccode == "A010") {
            this.Descript = "โรคปอดอักเสบ เกิดจากเชื้อไวรัส สามารถติดต่อผ่านจากการไอหรือการ โดยจะมีอาการไอ มีเสมหะ เจ็บหน้าอกขณะหายใจหรือไอ มีไข้ เหงื่อออก หนาวสั่น คลื่นไส้ อาเจียนหรือท้องเสีย ทำให้อาจเป็นโรคเยื่อหุ้มสมองอักเสบ ปอดอักเสบ ติดเชื้อในกระแสเลือด และอาจเสียชีวิตได้";
            this.Effect = "อาจมีอาการบวมเเดงบริเวณที่ฉีด";
            this.After = "ควรประคบเย็นบริเวณที่บวมเเดง";
            this.Cost1 = "ราคาเข็มละ 3,000 – 4,500 บาท";
            this.Cost2 = "ราคาเข็มละ 2,000 – 3,000บาท";
          }
          else if (this.VacDetail.vaccode == "A011") {
            this.Descript = "โรคติดเชื้อโรต้า เกิดจากเชื้อไวรัส สามารถติดต่อจากการทานอาหารเเละน้ำดื่มที่มีเชื้อปนเปื้อน หรือสัมผัสสิ่งของที่มีเชื้อ โดยจะมีอาการปวดท้อง ท้องเสีย มีไข้อาเจียน เกิดภาวะขาดน้ำและเกลือแร่";
            this.Effect = "อาจมีอาการไข้ เบื่ออาหาร  อาเจียน งอแง";
            this.After = "ควรให้ยาลดไข้เเละเช็ดตัวด้วยน้ำอุณหภูมิห้อง ส่วนบริเวณที่บวมให้ใช้วิธีประคบเย็น";
            this.Cost1 = null;
            this.Cost2 = null;
          }
          else if (this.VacDetail.vaccode == "A012") {
            this.Descript = "โรคไวรัสตับอักเสบเอเกิดจากเชื้อไวรัส สามารถได้รับเชื้อผ่านทางอาหารหรือน้ำดื่มที่ปนเปื้อนเชื้อ โดยจะมีอาการ อ่อนเพลีย ไข้ต่ำ เบื่ออาหาร คลื่นไส้อาเจียน เจ็บใต้ชายโครงขวา ปัสสาวะสีเหลืองเข้ม ภาวะตับวายได้ และอาจเสียชีวิตได้";
            this.Effect = "อาจมีอาการบวมและแดงเล็กน้อยตรงบริเวณที่ฉีด ปวดศีรษะ ครั่นเนื้อครั่นตัว อ่อนเพลีย ไข้ คลื่นไส้ เบื่ออาหาร";
            this.After = "ควรให้ยาลดไข้เเละเช็ดตัวด้วยน้ำอุณหภูมิห้อง ส่วนบริเวณที่บวมให้ใช้วิธีประคบเย็น";
            this.Cost1 = "ราคาเข็มละ 2,000 บาท";
            this.Cost2 = "ราคาเข็มละ 1,800 บาท";
          }
          else if (this.VacDetail.vaccode == "A013") {
            this.Descript = "โรคอีสุกอีใสเกิดจากเชื้อไวรัส สามารถติดต่อได้ทางน้ำลาย ไอ จาม การหายใจ เเละการสัมผัสกับแผลของผู้ป่วยที่เป็นโรค โดยจะมีอาการ ปวดศีรษะ เบื่ออาหาร มีไข้ และมีผื่นขึ้นที่ผิวหนัง ลักษณะผื่นระยะแรกเป็นตุ่มนูนแดงกระจายตามลำตัวมากกว่าที่หน้าหรือแขนขา ตุ่มอาจเกิดขึ้นในปากและลำคอได้ นอกจากนี้ยังมีความเสี่ยงที่จะติดเชื้อแบคทีเรียบนผื่น แล้วเข้ากระแสเลือด ทำให้ปอดอักเสบ เเละสมองอักเสบได้ ";
            this.Effect = "อาจมีอาการเจ็บปวด บวม หรือแดงบริเวณที่ฉีด";
            this.After = "ควรประคบเย็นบริเวณที่มีอาการปวดบวมเเดง";
            this.Cost1 = "ราคาเข็มละ 1300 – 2000 บาท";
            this.Cost2 = "ราคาเข็มละ 800-1000 บาท";
          }


        },
        error => {
        });


  }

}
